# Pandas

It is an open source pthon library for data analysis, data wrangling(cleanning and preparation)
It can work with data of any source
It has configurable high level data structures

FEATURES OF PANDAS
     
    Powerful data structure
    Fast and efficient data wrangling
    Easy data aggregation and transformation 
    Tools for reading/ writing data
    Data alignment
    High performance merging and joining datasets

PANDAS DATA STRUCTURES

    Series
    Data Frame
    Panel- 3D labelled array which supports multiple data types (items->axis 0, major axis->rows,minor axis->columns)
    Panel 4D(Experimental)-4D labelled array which supports multiple data types(labels->axis 0 items->axis 1, major axis->rows,minor axis->columns)

## Series

One dimensional labelled array that supports multiple data types
Series can carry any type of object such as string,numbers,built in functions
Series is like a python dictionary since it consists of labels and data just like dictionaries have key value pairs

In [1]:
import numpy as np
import pandas as pd

In [2]:
labels=['a','b','c']
mydata=[10,20,30]
arr=np.array(mydata)
d={'a':10,'b':20,'c':30}

In [3]:
pd.Series(data=mydata)

0    10
1    20
2    30
dtype: int64

In [4]:
pd.Series(data=mydata,index=labels)

a    10
b    20
c    30
dtype: int64

In [5]:
pd.Series(mydata,labels)

a    10
b    20
c    30
dtype: int64

In [6]:
pd.Series(np.array([10,20,30]))

0    10
1    20
2    30
dtype: int32

In [7]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [8]:
pd.Series(data=[print,sum,len])

0    <built-in function print>
1      <built-in function sum>
2      <built-in function len>
dtype: object

In [9]:
pd.Series(list('abcdef'))

0    a
1    b
2    c
3    d
4    e
5    f
dtype: object

In [161]:
pd.Series(5,index=['a','b','c','d','e'])

a    5
b    5
c    5
d    5
e    5
dtype: int64

### ACCESSING SERIES ELEMENTS

In [10]:
ser1=pd.Series(np.array([10,20,30]))
ser1

0    10
1    20
2    30
dtype: int32

In [11]:
ser1[1]

20

In [12]:
ser2=pd.Series(np.array([40,50,60]))
ser2

0    40
1    50
2    60
dtype: int32

In [13]:
ser1+ser2

0    50
1    70
2    90
dtype: int32

In [14]:
ser1+2

0    12
1    22
2    32
dtype: int32

In [15]:
d1={'a':10,'b':20,'c':30,'d':70}
d2={'a':10,'b':20,'c':30,'e':80}
serx=pd.Series(d1)
sery=pd.Series(d2)
serx+sery

a    20.0
b    40.0
c    60.0
d     NaN
e     NaN
dtype: float64

In [165]:
d1={'a':10,'b':20,'c':30,'d':70}
serx=pd.Series(d1)
serx

a    10
b    20
c    30
d    70
dtype: int64

In [166]:
# look up a value by name or index
serx.loc['a']

10

In [168]:
# look up  value using the position
serx.iloc[0]

10

## DATAFRAMES

A dataframe is a series which shares an index(a combination of multiple series with multiple indexes in 2 dimension) it is two dimensional
Think of it like an excel spreadsheet or a dictionary of series
It consists of columns and indexes
Each column is actually a series

In [17]:
from numpy.random import randn
np.random.seed(101)
# Seed() is used to initialize the random number generator.
# If you use the same seed every time you will get the same pattern random numbers
# It is used to generate a new set or repeats pseudo -random numbers

In [18]:
df=pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [169]:
olympic_list={'Hostcity':['London','Beijing','Athens','Sydney','Atlanta'], 'Year':[2012,2008,2004,2000,1996],'No_of_Countries':[205,204,201,200,197]}

In [171]:
olympics_data=pd.DataFrame(olympic_list)
olympics_data

  Hostcity  Year  No_of_Countries
0   London  2012              205
1  Beijing  2008              204
2   Athens  2004              201
3   Sydney  2000              200
4  Atlanta  1996              197

### ACCESSING DATAFRAME COLUMNS

In [19]:
df['W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [20]:
type(df['W'])

pandas.core.series.Series

In [21]:
type(df)

pandas.core.frame.DataFrame

In [22]:
df.W

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [23]:
df[['W','Z']]

          W         Z
A  2.706850  0.503826
B  0.651118  0.605965
C -2.018168 -0.589001
D  0.188695  0.955057
E  0.190794  0.683509

### CREATING NEW DATAFRAME COLUMNS

In [24]:
df['new']=df['W']+df['X']
df['new']

A    3.334983
B    0.331800
C   -1.278046
D   -0.570177
E    2.169552
Name: new, dtype: float64

### DROP COLUMNS

In [25]:
# inplace=True means that the column will be deleted permanently
# axis=1 represents vertical/columns while axis=0 represents indexes because the shape of numpy arrays consists of a tuple 
# whereby the element 0 represents number of rows ie.indexes in a dataframe while element 1 represents number of columns

In [26]:
df.drop("new",axis=1)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [27]:
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.334983
B  0.651118 -0.319318 -0.848077  0.605965  0.331800
C -2.018168  0.740122  0.528813 -0.589001 -1.278046
D  0.188695 -0.758872 -0.933237  0.955057 -0.570177
E  0.190794  1.978757  2.605967  0.683509  2.169552

In [28]:
df.drop("new",axis=1, inplace=True)

In [177]:
# Dropping empty values in a subset of a dataset
df.dropna(subset=df['W'],axis=1)

KeyError: 'W'

In [29]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [30]:
df.shape

(5, 4)

### ACCESSING DATAFRAME ROWS

In [31]:
# Two methods are used for this: loc and iloc(index location)
# iloc is numerical based while loc is label based

In [32]:
df.loc['A']

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

In [33]:
df.loc[['A','B']]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965

In [34]:
df.iloc[2]
# Accesses row C

W   -2.018168
X    0.740122
Y    0.528813
Z   -0.589001
Name: C, dtype: float64

### SELECTING SUBSET OF  ROWS AND COLUMNS

In [35]:
df.loc['A','Z']

0.5038257538223936

In [36]:
df.iloc[2,2]
# Selects value in index C and column Y

0.5288134940893595

In [37]:
df.loc[['A','B'],['W','Y']]

          W         Y
A  2.706850  0.907969
B  0.651118 -0.848077

### CONDITIONAL SELECTION

In [38]:
df>0

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [39]:
df[df>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [40]:
df['W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [41]:
df['W']>0

A     True
B     True
C    False
D     True
E     True
Name: W, dtype: bool

In [42]:
df[df['W']>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [43]:
df[df['Z']<0]

          W         X         Y         Z
C -2.018168  0.740122  0.528813 -0.589001

In [44]:
df[df['Z']>0]['X']
# The above code is similar to the following code below

A    0.628133
B   -0.319318
D   -0.758872
E    1.978757
Name: X, dtype: float64

In [45]:
resultdf=df[df['Z']>0]
resultdf

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [46]:
resultdf['X']

A    0.628133
B   -0.319318
D   -0.758872
E    1.978757
Name: X, dtype: float64

In [47]:
df[df['Z']>0][['X','Y']]

          X         Y
A  0.628133  0.907969
B -0.319318 -0.848077
D -0.758872 -0.933237
E  1.978757  2.605967

In [48]:
df[(df['Z']>0) & (df['Y']<0)]

          W         X         Y         Z
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057

In [49]:
df[(df['Z']>0) | (df['Y']<0)]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

### RESET INDEX TO NUMERICAL

In [50]:
# If you want the reset index method to affect the original dataframe
# include inplace=True

In [51]:
df.reset_index()

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

### SET INDEX WITH AN EXISTING COLUMN

In [52]:
# If you want the set index method to affect the original dataframe
# include inplace=True

In [53]:
newind= 'CA NY WY OR CO'.split()
newind

['CA', 'NY', 'WY', 'OR', 'CO']

In [54]:
df['States']=newind
df

          W         X         Y         Z States
A  2.706850  0.628133  0.907969  0.503826     CA
B  0.651118 -0.319318 -0.848077  0.605965     NY
C -2.018168  0.740122  0.528813 -0.589001     WY
D  0.188695 -0.758872 -0.933237  0.955057     OR
E  0.190794  1.978757  2.605967  0.683509     CO

In [55]:
df.set_index('States')

               W         X         Y         Z
States
CA      2.706850  0.628133  0.907969  0.503826
NY      0.651118 -0.319318 -0.848077  0.605965
WY     -2.018168  0.740122  0.528813 -0.589001
OR      0.188695 -0.758872 -0.933237  0.955057
CO      0.190794  1.978757  2.605967  0.683509

### HIERACHICAL INDEXING

In [56]:
outside=['G1','G1','G1','G2','G2','G2']
inside=[1,2,3,1,2,3]
hier_index=tuple(zip(outside,inside))
hier_index

(('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3))

In [57]:
hier_index2=pd.MultiIndex.from_tuples(hier_index)

In [58]:
hier_index2

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [59]:
df=pd.DataFrame(randn(6,2),hier_index,['A','B'])
df

             A         B
G1 1  0.302665  1.693723
   2 -1.706086 -1.159119
   3 -0.134841  0.390528
G2 1  0.166905  0.184502
   2  0.807706  0.072960
   3  0.638787  0.329646

### ACCESSING ELEMENTS

In [60]:
# To access elements from a hierachical index requires one to start form the outside index to the inside

In [61]:
df.loc['G1']

          A         B
1  0.302665  1.693723
2 -1.706086 -1.159119
3 -0.134841  0.390528

In [62]:
df.loc['G1'].loc[1]

A    0.302665
B    1.693723
Name: 1, dtype: float64

In [63]:
df.index.names

FrozenList([None, None])

In [64]:
df.index.names=['Groups','Num']
df

                   A         B
Groups Num
G1     1    0.302665  1.693723
       2   -1.706086 -1.159119
       3   -0.134841  0.390528
G2     1    0.166905  0.184502
       2    0.807706  0.072960
       3    0.638787  0.329646

In [65]:
df.loc['G2'].loc[2]['B']

0.07295967531703869

### CROSSECTION

In [66]:
df.xs('G1')
# Similar to df.loc['G1']

            A         B
Num
1    0.302665  1.693723
2   -1.706086 -1.159119
3   -0.134841  0.390528

In [67]:
 df.loc['G1']

            A         B
Num
1    0.302665  1.693723
2   -1.706086 -1.159119
3   -0.134841  0.390528

In [68]:
df.xs(1,level='Num')

               A         B
Groups
G1      0.302665  1.693723
G2      0.166905  0.184502

## MISSING DATA

In [69]:
d={'A':[1,2,np.nan],'B':[5,np.nan,np.nan], 'C':[1,2,3]}

In [70]:
df= pd.DataFrame(d)
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [71]:
df.isnull()
# Shows a boolean table whereby if it is True then it is null

       A      B      C
0  False  False  False
1  False   True  False
2   True   True  False

In [72]:
df.isna()

       A      B      C
0  False  False  False
1  False   True  False
2   True   True  False

In [73]:
df.isna().sum()
# Similar to df.isnull().sum()

A    1
B    2
C    0
dtype: int64

In [74]:
df.dropna()
# Drops any row with any missing value since by default axis=0

     A    B  C
0  1.0  5.0  1

In [75]:
df.dropna(axis=1)
# Drops any column with any missing value

   C
0  1
1  2
2  3

In [76]:
df.dropna(thresh=2)
# thresh=2 means that during dropping the row with 2 non missing values will be retained

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [77]:
df.fillna('New')
# fillna is used in replacing the missing values with a certain value

     A    B  C
0  1.0  5.0  1
1  2.0  New  2
2  New  New  3

In [78]:
df.fillna(value='New')

     A    B  C
0  1.0  5.0  1
1  2.0  New  2
2  New  New  3

In [79]:
df.fillna(df.mean())

     A    B  C
0  1.0  5.0  1
1  2.0  5.0  2
2  1.5  5.0  3

In [80]:
df['A'].fillna(df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

## GROUP BY

In [81]:
# Group by allows you to group together rows based off of a column and perform an aggregate function on them

In [82]:
data={'Company': ['Google','Microsoft','Facebook','Google','Microsoft','Facebook'],
 'Person': ['Sam', 'Charle', 'Amy', 'victor', 'Joe', 'Kelvin'],
 'Sales': [200, 120, 300, 200, 600, 800]}

In [83]:
df=pd.DataFrame(data)
df

     Company  Person  Sales
0     Google     Sam    200
1  Microsoft  Charle    120
2   Facebook     Amy    300
3     Google  victor    200
4  Microsoft     Joe    600
5   Facebook  Kelvin    800

In [84]:
df.groupby('Company').mean()

           Sales
Company
Facebook     550
Google       200
Microsoft    360

In [85]:
df.groupby('Person').max()

          Company  Sales
Person
Amy      Facebook    300
Charle  Microsoft    120
Joe     Microsoft    600
Kelvin   Facebook    800
Sam        Google    200
victor     Google    200

In [86]:
df.describe()

            Sales
count    6.000000
mean   370.000000
std    269.443872
min    120.000000
25%    200.000000
50%    250.000000
75%    525.000000
max    800.000000

In [87]:
df.groupby('Company').std()

                Sales
Company
Facebook   353.553391
Google       0.000000
Microsoft  339.411255

In [88]:
df.groupby('Company').sum()

           Sales
Company
Facebook    1100
Google       400
Microsoft    720

In [89]:
df.groupby('Company').sum().loc['Facebook']

Sales    1100
Name: Facebook, dtype: int64

In [90]:
df.groupby('Company').count()

           Person  Sales
Company
Facebook        2      2
Google          2      2
Microsoft       2      2

In [91]:
df.groupby('Company').max()

           Person  Sales
Company
Facebook   Kelvin    800
Google     victor    200
Microsoft     Joe    600

In [92]:
df.groupby('Company').describe()

          Sales
          count   mean         std    min    25%    50%    75%    max
Company
Facebook    2.0  550.0  353.553391  300.0  425.0  550.0  675.0  800.0
Google      2.0  200.0    0.000000  200.0  200.0  200.0  200.0  200.0
Microsoft   2.0  360.0  339.411255  120.0  240.0  360.0  480.0  600.0

In [93]:
df.groupby('Company').describe().transpose()

Company        Facebook  Google   Microsoft
Sales count    2.000000     2.0    2.000000
      mean   550.000000   200.0  360.000000
      std    353.553391     0.0  339.411255
      min    300.000000   200.0  120.000000
      25%    425.000000   200.0  240.000000
      50%    550.000000   200.0  360.000000
      75%    675.000000   200.0  480.000000
      max    800.000000   200.0  600.000000

In [94]:
df.groupby('Company').describe().transpose()['Facebook']

Sales  count      2.000000
       mean     550.000000
       std      353.553391
       min      300.000000
       25%      425.000000
       50%      550.000000
       75%      675.000000
       max      800.000000
Name: Facebook, dtype: float64

In [95]:
df.sort_values(by='Sales')

     Company  Person  Sales
1  Microsoft  Charle    120
0     Google     Sam    200
3     Google  victor    200
2   Facebook     Amy    300
4  Microsoft     Joe    600
5   Facebook  Kelvin    800

In [96]:
df['Company'].unique()

array(['Google', 'Microsoft', 'Facebook'], dtype=object)

In [97]:
df.pivot_table(values='Sales',index=['Company'],columns=['Person'])

Person       Amy  Charle    Joe  Kelvin    Sam  victor
Company
Facebook   300.0     NaN    NaN   800.0    NaN     NaN
Google       NaN     NaN    NaN     NaN  200.0   200.0
Microsoft    NaN   120.0  600.0     NaN    NaN     NaN

## MERGE JOIN CONCATENATING

Concatenation basically glues together dataframes. 
Keep in mind the dimensions should match along the axis you are concatenating on

In [98]:
df1=pd.DataFrame(index=[1,2,3,4,5,6],data={'Company': ['Google',
  'Microsoft',
  'Facebook',
  'Google',
  'Microsoft',
  'Facebook'],
 'Person': ['Sam', 'Charle', 'Amy', 'victor', 'Joe', 'Kelvin'],
 'Sales': [200, 120, 300, 200, 600, 800]})
df2=pd.DataFrame(index=[7,8,9,10,11,12],data={'Company': ['Google',
  'Microsoft',
  'Facebook',
  'Google',
  'Microsoft',
  'Facebook'],
 'Person': ['victor', 'Joe', 'Kelvin','Sam', 'Charle', 'Amy' ],
 'Sales': [200, 120, 300, 450, 600, 800]})

In [99]:
pd.concat([df1,df2])

      Company  Person  Sales
1      Google     Sam    200
2   Microsoft  Charle    120
3    Facebook     Amy    300
4      Google  victor    200
5   Microsoft     Joe    600
6    Facebook  Kelvin    800
7      Google  victor    200
8   Microsoft     Joe    120
9    Facebook  Kelvin    300
10     Google     Sam    450
11  Microsoft  Charle    600
12   Facebook     Amy    800

In [100]:
pd.concat([df1,df2], axis=1)

      Company  Person  Sales    Company  Person  Sales
1      Google     Sam  200.0        NaN     NaN    NaN
2   Microsoft  Charle  120.0        NaN     NaN    NaN
3    Facebook     Amy  300.0        NaN     NaN    NaN
4      Google  victor  200.0        NaN     NaN    NaN
5   Microsoft     Joe  600.0        NaN     NaN    NaN
6    Facebook  Kelvin  800.0        NaN     NaN    NaN
7         NaN     NaN    NaN     Google  victor  200.0
8         NaN     NaN    NaN  Microsoft     Joe  120.0
9         NaN     NaN    NaN   Facebook  Kelvin  300.0
10        NaN     NaN    NaN     Google     Sam  450.0
11        NaN     NaN    NaN  Microsoft  Charle  600.0
12        NaN     NaN    NaN   Facebook     Amy  800.0

In [101]:
df1=pd.DataFrame({'Company': ['Google',
  'Microsoft',
  'Facebook',
  'Google',
  'Microsoft',
  'Facebook'],
 'Person': ['Sam', 'Charle', 'Amy', 'victor', 'Joe', 'Kelvin'],
 'Sales': [200, 120, 300, 400, 600, 800]})
df2=pd.DataFrame({'Company': ['Google',
  'Microsoft',
  'Facebook',
  'Google',
  'Microsoft',
  'Facebook'],
 'Person': ['victor', 'Joe', 'Kelvin','Sam', 'Charle', 'Amy' ],
 'Sales': [200, 120, 300, 450, 600, 800]})

In [102]:
pd.concat([df1,df2], axis=1)

     Company  Person  Sales    Company  Person  Sales
0     Google     Sam    200     Google  victor    200
1  Microsoft  Charle    120  Microsoft     Joe    120
2   Facebook     Amy    300   Facebook  Kelvin    300
3     Google  victor    400     Google     Sam    450
4  Microsoft     Joe    600  Microsoft  Charle    600
5   Facebook  Kelvin    800   Facebook     Amy    800

MERGE

In [103]:

left=pd.DataFrame({'Key1': ['K0','K1','K2','K3'],
 'A': ['A0','A1','A2','A3'],
 'B': ['B0','B1','B2','B3']})
right=pd.DataFrame({'Key1': ['K0','K1','K2','K3'],
 'C': ['C0','C1','C2','C3'],
 'D': ['D0','D1','D2','D3']})
left

  Key1   A   B
0   K0  A0  B0
1   K1  A1  B1
2   K2  A2  B2
3   K3  A3  B3

In [104]:
right

  Key1   C   D
0   K0  C0  D0
1   K1  C1  D1
2   K2  C2  D2
3   K3  C3  D3

In [105]:
pd.merge(left,right)

  Key1   A   B   C   D
0   K0  A0  B0  C0  D0
1   K1  A1  B1  C1  D1
2   K2  A2  B2  C2  D2
3   K3  A3  B3  C3  D3

In [106]:
left=pd.DataFrame({'Key1': ['K0','K0','K1','K2'],
 'Key2': ['K0','K1','K0','K1'],
 'A': ['A0','A1','A2','A3'],
 'B': ['B0','B1','B2','B3']})
right=pd.DataFrame({'Key1': ['K0','K1','K1','K2'],
 'Key2': ['K0','K0','K0','K0'],
 'C': ['C0','C1','C2','C3'],
 'D': ['D0','D1','D2','D3']})

In [107]:
pd.merge(left,right)
# By default the type of merge is inner

  Key1 Key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K0  A2  B2  C1  D1
2   K1   K0  A2  B2  C2  D2

In [108]:
pd.merge(left,right,on=['Key1','Key2'])
# the 2 dataframes are merged based on Key1 and Key2 columns

  Key1 Key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K0  A2  B2  C1  D1
2   K1   K0  A2  B2  C2  D2

In [109]:
pd.merge(left,right,how='outer',on=['Key1','Key2'])

  Key1 Key2    A    B    C    D
0   K0   K0   A0   B0   C0   D0
1   K0   K1   A1   B1  NaN  NaN
2   K1   K0   A2   B2   C1   D1
3   K1   K0   A2   B2   C2   D2
4   K2   K1   A3   B3  NaN  NaN
5   K2   K0  NaN  NaN   C3   D3

In [110]:
pd.merge(left,right, how='right',on=['Key1','Key2'])

  Key1 Key2    A    B   C   D
0   K0   K0   A0   B0  C0  D0
1   K1   K0   A2   B2  C1  D1
2   K1   K0   A2   B2  C2  D2
3   K2   K0  NaN  NaN  C3  D3

In [111]:
pd.merge(left,right,how='left',on=['Key1','Key2'])

  Key1 Key2   A   B    C    D
0   K0   K0  A0  B0   C0   D0
1   K0   K1  A1  B1  NaN  NaN
2   K1   K0  A2  B2   C1   D1
3   K1   K0  A2  B2   C2   D2
4   K2   K1  A3  B3  NaN  NaN

JOIN

Joining is a convenient method of combining 2 potentially indexed dataframes into a single result dataframe
It is similar to merge but the difference is that in this the index is used in merging

In [112]:
left=pd.DataFrame({
 'A': ['A0','A1','A2'],
 'B': ['B0','B1','B2']}, index=['K0','K1','K2'])
right=pd.DataFrame({
 'C': ['C0','C2','C3'],
 'D': ['D0','D2','D3']},
index=['K0','K2','K3'])

In [113]:
left.join(right)
# By default the type of join is inner

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

In [114]:
left.join(right, how='right')

      A    B   C   D
K0   A0   B0  C0  D0
K2   A2   B2  C2  D2
K3  NaN  NaN  C3  D3

In [115]:
left.join(right, how='left')

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

In [116]:
left.join(right, how='outer')

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3  NaN  NaN   C3   D3

## ADDITION OPERATIONS

In [117]:
data={'Company': ['Google','Microsoft','Facebook','Google','Microsoft','Facebook'],
 'Person': ['Sam', 'Charle', 'Amy', 'victor', 'Joe', 'Kelvin'],
 'Sales': [200, 120, 300, 200, 600, 800]}

In [118]:
df=pd.DataFrame(data)
df

     Company  Person  Sales
0     Google     Sam    200
1  Microsoft  Charle    120
2   Facebook     Amy    300
3     Google  victor    200
4  Microsoft     Joe    600
5   Facebook  Kelvin    800

In [119]:
df.index

RangeIndex(start=0, stop=6, step=1)

In [120]:
groupx=df.groupby('Sales')
groupx.size()

Sales
120    1
200    2
300    1
600    1
800    1
dtype: int64

In [121]:
groupx.get_group(200)
# Obtaining the group with sales 200

  Company  Person  Sales
0  Google     Sam    200
3  Google  victor    200

In [122]:
df['Company'].unique()
# unique() returns the unique values of a column

array(['Google', 'Microsoft', 'Facebook'], dtype=object)

In [123]:
df['Company'].nunique()
# nunique returns the number of unique values

3

In [124]:
df.head(5)

     Company  Person  Sales
0     Google     Sam    200
1  Microsoft  Charle    120
2   Facebook     Amy    300
3     Google  victor    200
4  Microsoft     Joe    600

In [125]:
df['Company'].value_counts()
# Return the unique values in a column and the number of times they appear

Microsoft    2
Google       2
Facebook     2
Name: Company, dtype: int64

In [126]:
def times2(x):
    return x*2

In [127]:
df['Sales'].apply(times2)
# Similar to the following

0     400
1     240
2     600
3     400
4    1200
5    1600
Name: Sales, dtype: int64

In [128]:
df['Sales'].apply(lambda x:x*2)

0     400
1     240
2     600
3     400
4    1200
5    1600
Name: Sales, dtype: int64

In [129]:
df['Company'].apply(len)
#len calculates length of strings in a column

0    6
1    9
2    8
3    6
4    9
5    8
Name: Company, dtype: int64

In [130]:
df

     Company  Person  Sales
0     Google     Sam    200
1  Microsoft  Charle    120
2   Facebook     Amy    300
3     Google  victor    200
4  Microsoft     Joe    600
5   Facebook  Kelvin    800

In [131]:
df.columns

Index(['Company', 'Person', 'Sales'], dtype='object')

In [132]:
df.index

RangeIndex(start=0, stop=6, step=1)

In [133]:
df.sort_values('Company')
# Sorting values by a specific column

     Company  Person  Sales
2   Facebook     Amy    300
5   Facebook  Kelvin    800
0     Google     Sam    200
3     Google  victor    200
1  Microsoft  Charle    120
4  Microsoft     Joe    600

In [134]:
df.sort_values('Sales')

     Company  Person  Sales
1  Microsoft  Charle    120
0     Google     Sam    200
3     Google  victor    200
2   Facebook     Amy    300
4  Microsoft     Joe    600
5   Facebook  Kelvin    800

In [135]:
df.pivot_table(values='Sales',index='Person',columns='Company')

Company  Facebook  Google  Microsoft
Person
Amy         300.0     NaN        NaN
Charle        NaN     NaN      120.0
Joe           NaN     NaN      600.0
Kelvin      800.0     NaN        NaN
Sam           NaN   200.0        NaN
victor        NaN   200.0        NaN

In [136]:
df.pivot_table(values='Sales',index='Company',columns='Person')

Person       Amy  Charle    Joe  Kelvin    Sam  victor
Company
Facebook   300.0     NaN    NaN   800.0    NaN     NaN
Google       NaN     NaN    NaN     NaN  200.0   200.0
Microsoft    NaN   120.0  600.0     NaN    NaN     NaN

## DATA INPUT AND OUTPUT

Pandas has the ability to read csv,excel,html,sql files and more
In order to read html and sql files one has to install the following:

    conda install sqlalchemy
    
    conda install lxml
    
    conda install html5lib
    
    conda install BeautifulSoup4

In [137]:
df=pd.read_csv('C:/Users/VICKFURY/Documents/projects/Python Scripts/ml/datasets/Movie_Id_Titles')
df

      item_id                                      title
0           1                           Toy Story (1995)
1           2                           GoldenEye (1995)
2           3                          Four Rooms (1995)
3           4                          Get Shorty (1995)
4           5                             Copycat (1995)
...       ...                                        ...
1677     1678                          Mat' i syn (1997)
1678     1679                           B. Monkey (1998)
1679     1680                       Sliding Doors (1998)
1680     1681                        You So Crazy (1994)
1681     1682  Scream of Stone (Schrei aus Stein) (1991)

[1682 rows x 2 columns]

In [138]:
pd.read_csv('C:/Users/VICKFURY/Documents/projects/Python Scripts/ml/datasets/Movie_Id_Titles',skiprows=1)
# Skips the first rows

         1                                   Toy Story (1995)
0        2                                   GoldenEye (1995)
1        3                                  Four Rooms (1995)
2        4                                  Get Shorty (1995)
3        5                                     Copycat (1995)
4        6  Shanghai Triad (Yao a yao yao dao waipo qiao) ...
...    ...                                                ...
1676  1678                                  Mat' i syn (1997)
1677  1679                                   B. Monkey (1998)
1678  1680                               Sliding Doors (1998)
1679  1681                                You So Crazy (1994)
1680  1682          Scream of Stone (Schrei aus Stein) (1991)

[1681 rows x 2 columns]

In [139]:
df.count()

item_id    1682
title      1682
dtype: int64

In [140]:
pwd

'C:\\Users\\VICKFURY\\Documents\\projects\\Python Scripts\\ml\\ml codes\\Intro to Data Science, AI, Machine Learning\\Data Science'

In [141]:
df.index

RangeIndex(start=0, stop=1682, step=1)

In [142]:
df.to_csv('Output',index=False)#Write the output in a csv file named output
# index=False must be there to prevent an unnamed index column from forming in the file
pd.read_csv('Output')

      item_id                                      title
0           1                           Toy Story (1995)
1           2                           GoldenEye (1995)
2           3                          Four Rooms (1995)
3           4                          Get Shorty (1995)
4           5                             Copycat (1995)
...       ...                                        ...
1677     1678                          Mat' i syn (1997)
1678     1679                           B. Monkey (1998)
1679     1680                       Sliding Doors (1998)
1680     1681                        You So Crazy (1994)
1681     1682  Scream of Stone (Schrei aus Stein) (1991)

[1682 rows x 2 columns]

In [143]:
pd.read_excel('flie path',sheetname='Sheet1')

TypeError: read_excel() got an unexpected keyword argument 'sheetname'

In [144]:
df.to_excel('Excelsample1.xlsx',sheet_name='NewSheet')

In [145]:
data= pd.read_html('html link')
# Looks for tables

ValueError: No tables found

In [ ]:
type(data)

In [146]:
# In orderto read to sql there must be a specific engine for the db because there is Mysql, Postgresql and many more with
# different engines
from sqlalchemy import create_engine
engine=create_engine('sqlite:///:memory:')

In [147]:
df.to_sql('sqltable',engine)

In [148]:
pd.read_sql('sqltable',con=engine)

      index  item_id                                      title
0         0        1                           Toy Story (1995)
1         1        2                           GoldenEye (1995)
2         2        3                          Four Rooms (1995)
3         3        4                          Get Shorty (1995)
4         4        5                             Copycat (1995)
...     ...      ...                                        ...
1677   1677     1678                          Mat' i syn (1997)
1678   1678     1679                           B. Monkey (1998)
1679   1679     1680                       Sliding Doors (1998)
1680   1680     1681                        You So Crazy (1994)
1681   1681     1682  Scream of Stone (Schrei aus Stein) (1991)

[1682 rows x 3 columns]

# SQL OPERATION IN PANDAS

In [149]:
import pandas as pd
import sqlite3

In [150]:
create_table ="""
CREATE TABLE student_score
(Id INTEGER, Name VARCHAR(20), Math REAL, 
Science REAL);
"""

In [151]:
executestmt=sqlite3.connect(':memory:')
executestmt.execute(create_table)
executestmt.commit()

In [152]:
sql_query=executestmt.execute('select * from student_score')

In [153]:
resultset=sql_query.fetchall()
resultset

[]

In [154]:
insertSQL= [(10,'Jack',85,92),(29,'Tom',73,89),(65,'Ram',65.5,77),(5,'Steve',55,91)]

In [155]:
insertstmt='INSERT INTO student_score Values(?,?,?,?)'

In [156]:
executestmt.executemany(insertstmt,insertSQL)
executestmt.commit()

In [157]:
sql_query=executestmt.execute('select * from student_score')
resultset=sql_query.fetchall()
resultset

[(10, 'Jack', 85.0, 92.0),
 (29, 'Tom', 73.0, 89.0),
 (65, 'Ram', 65.5, 77.0),
 (5, 'Steve', 55.0, 91.0)]

In [158]:
studentcolumns=pd.DataFrame(sql_query.description)[0]
studentcolumns

0         Id
1       Name
2       Math
3    Science
Name: 0, dtype: object

In [159]:
df_student_records=pd.DataFrame(resultset,columns=studentcolumns)

In [160]:
df_student_records

0  Id   Name  Math  Science
0  10   Jack  85.0     92.0
1  29    Tom  73.0     89.0
2  65    Ram  65.5     77.0
3   5  Steve  55.0     91.0